// @leet imports start
// Created: 2026-08-28 13:16:13

#include "../utils.h"
#include <vector>

using namespace std;
// @leet imports end

// @leet start
class Solution {
public:
  int minPathSum(vector<vector<int>> &grid) {
    int m = grid.size(), n = grid[0].size();
    vector<int> dp(n + 1, INT_MAX);
    dp[1] = 0;
    for (int i = 0; i < m; i++) {
      for (int j = 1; j <= n; j++) {
        dp[j] = grid[i][j - 1] + min(dp[j], dp[j - 1]);
      }
    }
    return dp.back();
  }
};
// @leet end

// @card idea 动态规划
// 这里使用滚动数组优化空间复杂度。不过有一些点需要注意：
// 1. 因为是要从左边和上边选择一个比较小的路径过来，因此初值应该设置比较大避免直接从边界「穿越」过来；
// 2. 由于存储的是当前行的路径和最小值，需要考虑比潜在的最大值更大，不能只是简单地比格最大值大；
// 3. 出发点两侧都是障碍会有问题，需要在 `-1` 行的 `1` 位置「挖洞」放行，代表可以零代价到达起点；
// 4. 不能在 `0` 行的 `0` 位置，因为这个值是左侧的「障碍」，对每一行都生效，而 `-1` 行的障碍在后面每行迭代中会不断更新，没有影响。

int main() {
  Solution s;
  CHECK(s.minPathSum("[[2]]"_vvi), 2);
  CHECK(s.minPathSum("[[1,3,1],[1,5,1],[4,2,1]]"_vvi), 7);
  CHECK(s.minPathSum("[[1,2,3],[4,5,6]]"_vvi), 12);
  CHECK(s.minPathSum("[[1,2],[1,1]]"_vvi), 3);
  CHECK(
      s.minPathSum(
          "[[100,100,100],[100,100,100],[100,100,100],[100,100,100],[100,100,100],[100,100,100],[100,100,100],[100,100,100],[100,100,100],[100,100,100],[100,100,100],[100,100,100],[100,100,100],[100,100,100],[100,100,100],[100,100,100],[100,100,100],[100,100,100],[100,100,100],[100,100,100],[100,100,100],[100,100,100],[100,100,100],[100,100,100],[100,100,100],[100,100,100],[100,100,100],[100,100,100],[100,100,100],[100,100,100],[100,100,100],[100,100,100],[100,100,100],[100,100,100],[100,100,100],[100,100,100],[100,100,100],[100,100,100],[100,100,100],[100,100,100],[100,100,100],[100,100,100],[100,100,100],[100,100,100],[100,100,100],[100,100,100],[100,100,100],[100,100,100],[100,100,100],[100,100,100],[100,100,100],[100,100,100]]"_vvi),
      5400);
  return 0;
}
